---
kind: type
id: T:Autodesk.Revit.DB.SubfaceType
source: html/20b2a2c2-53b4-caab-ce4c-aec68a2aa084.htm
---
# Autodesk.Revit.DB.SubfaceType

Meaning of a subface's type.

## Syntax (C#)
```csharp
public enum SubfaceType
```